# FindByName Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportPDFSettings..::..FindByName Method
ExportPDFSettings Class See Also
---
Returns settings element by name.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public static ExportPDFSettings FindByName(
	Document document,
	string name
)
```

Visual Basic
---
```text
Public Shared Function FindByName ( _
	document As Document, _
	name As String _
) As ExportPDFSettings
```

Visual C++
---
```text
public:
static ExportPDFSettings^ FindByName(
	Document^ document,
	String^ name
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document to find the settings with the specified name.
name
    Type: System..::..String Name of the settings to find.
# ### Return Value
The settings element, or nullNothingnullptra null reference (Nothing in Visual Basic) if not found.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | name cannot include prohibited characters, such as "{, }, [, ], | , ;, less-than sign, greater-than sign, ?, `, ~". |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExportPDFSettings Class
Autodesk.Revit.DB Namespace